# 仰晨不牛马
# 牛马时间：2022/6/12 00:43:22

print('--------模拟银行取款-------------')

c次数 = 0
while c次数 < 3:
    m密码 = input('假设已经插卡，卡密为556556\n请输入密码')
    if m密码 == '556556':

        y余额 = 1200
        print('余额为%d，' % y余额, end='')
        q取 = int(input('请输入取款金额'))
        if y余额 >= q取:
            y余额 = y余额 - q取
            print('取款成功，余额剩余:', y余额)
            break  # 跳出循环

        else:
            print('当前余额为%d，余额不足，请确认后重新输入' % y余额)
        print('--------模拟银行取款结束-------------')

    else:
        if c次数 == 2:
            print('密码错误3次，卡已被吞，请去银行前台咨询')
        else:
            print('密码有误，请重新输入')

    c次数 += 1

# continue:跳过这一次循环
print('1到50中5的倍数：', end='')
for 牛马 in range(1, 51):
    if 牛马 % 5 != 0:
        continue
    print(牛马, end='  ')
