# 仰晨不牛马
# 牛马时间：2022/6/13 01:11:54


##################################3############3
print('打印矩形')
for _ in range(1, 4):
    for 名字 in range(1, 10):
        print('*', end='')
    print('\n', end='')

################################################break
print('尝试打印三角形')
for _ in range(1, 10):
    for 名字 in range(1, 10):
        if _ >= 名字:
            print('*', end='')
        else:
            break
    print('\n', end='')

##############################################
print('老师打印三角形')
for 名字 in range(1, 10):
    for 名 in range(1, 名字 + 1):
        print('*', end='')

    print()  # 相当于换行

############################################
print('打印99乘法表')
for 名字 in range(1, 10):
    for 名 in range(1, 名字 + 1):
        print(名, '*', 名字, '=', 名字 * 名, end='\t')

    print()
