# 仰晨不牛马
# 牛马时间：2022/6/17 03:07:30

print('-----------------在列表的尾部添加一个元素.append()-------------------------------------------------')
l列表1 = [10, 20, 30, 40]
print('添加前', l列表1, id(l列表1))
l列表1.append(56)
print('添加后', l列表1, id(l列表1))

l列表2 = ['牛马', '却', 'ikun']
l列表2.append(l列表1)

print(l列表2)  # ['牛马', '却', 'ikun', [10, 20, 30, 40, 56]]#最后是一个元素

print('-----------------在列表的尾部添加多个元素.extend()------------------------------------------------')
l列表3 = ['只因', '你', '太美']
print(l列表3)
l列表4 = ['小黑子', '荔枝', '苏珊']
l列表4.extend(l列表3)
l列表4.extend(['树脂', '两年半'])
l列表4.extend('iKun')  # 我擦   'i', 'K', 'u', 'n'
print(l列表4)

print('-----------------在列表的指定位置添加一个元素insert------------------------------------------------')
l列表5 = [167, '北冥有鱼', '其名为', '元素4']
print(l列表5)
l列表5.insert(3, "@@kun")  # 在位置3（从0开始）插入@@kun
l列表5.insert(3, '鲲')
print(l列表5)

print('-----------------在列表的指定位置添加多个元素（切片）[:]------------------------------------------------')
l列表6 = ['jjj', 'nnn', 'ttt', 'mmm']
print(l列表6)
l列表7 = [True, '你犯法了', False, '知道吗']
print(l列表7)
l列表6[1:3] = l列表7
print(l列表6)  # ['jjj', True, '你犯法了', False, '知道吗', 'mmm']#把列表1到3（不包括3）替换插入列表7进去

l列表7[1:] = ["你说的都对", '错是tan90度']
print(l列表7)  # [True, '你说的都对', '错是tan90度']
l列表7[:2] = [1, 6, 7]
print(l列表7)  # [1, 6, 7, '错是tan90度']
l列表7[3:3] = ['不换掉其他元素', "nice"]
print(l列表7)  # [1, 6, 7, '不换掉其他元素', 'nice', '错是tan90度']
l列表7[-1:-1] = [1]
print(l列表7)  # [1, 6, 7, '不换掉其他元素', 'nice', 1, '错是tan90度']
