#仰晨不牛马
#牛马时间：2022/6/30 01:52:40

lb列表=[i for i in range(1,10)]#最全面的i表示列表元素的表达式

print(lb列表)                 #[1, 2, 3, 4, 5, 6, 7, 8, 9]


lb列表=[i*i for i in range(1,10)]     #生成的每一个数乘自己本身

print(lb列表)                  #[1, 4, 9, 16, 25, 36, 49, 64, 81]


lb列表=[i+6 for i in range(1,10)]     #生成的每一个数+6

print(lb列表)                 #[7, 8, 9, 10, 11, 12, 13, 14, 15]


lb列表=[6666 for i in range(1,10)]        #[6666, 6666, 6666, 6666, 6666, 6666, 6666, 6666, 6666]
print(lb列表)


print('===============怎么搞到一个2 4 6 8 10 的列表===================')
列表=[z增*2 for z增 in range(1,6)]
print(列表)         #[2, 4, 6, 8, 10]







