#仰晨不牛马
#牛马时间：2022/6/30 02:20:39

print('----------------创建字典的第一种方式{}----------------------')
z字典={'键':'值','张三':95,'李四':67,'王五':66}

print(z字典)
print(type(z字典))        #<class 'dict'>

print('----------------创建字典的第二种方式 dict()----------------------')
zz字典=dict(key='值',没引号='神奇',后为值=167)
print(zz字典)     #{'key': '值', '没引号': '神奇', '后为值': 167}


空字典={}
print(空字典)      #{}


print('************************字典元素的获取的两种方法--[]--get()*****************************')
z牛马字典={'鸡':'ji','你':'ni','太':'tai','美':'mei',"牛避":666}
print('----第一种方法[]-当键（key）不存在会报错-----')
查字典=z牛马字典['鸡']

print(查字典,z牛马字典['美'])       #ji mei
#print(z牛马字典['牛鸡'])#键（key）不存在报错   #KeyError: '牛鸡'


print('----第二种方法.get()-当键（key）不存在不会报错，返回None-----')
print(z牛马字典.get('牛避'))      #666
print(z牛马字典.get('tan90'))     #None
print(z牛马字典.get('不存在',6767))     #键key‘不存在’对应的值value不存在时，返回设定的默认值   #6767


print('************************字典键对应的值是否存在的判定 in ** not in*************************')

z判定字典={'鸡':'ji','你':'ni','太':'tai','美':'mei','nb':666,67:'7头'}

print('荔枝' in z判定字典)           # False
print('树枝' not in z判定字典)       # True
print('鸡' in z判定字典)             # True


print('************************删除字典元素 del *【】************************')
z删除字典={'鸡':'ji','你':'ni','太':'tai','美':'mei','nb':666,67:'7头'}

del z删除字典['nb'] #删除键key为nb的元素
print(z删除字典)    #{'鸡': 'ji', '你': 'ni', '太': 'tai', '美': 'mei', 67: '7头'}
z删除字典.clear()   #清空字典
print(z删除字典)    #{}

print('************************新增和修改字典元素 =************************')
z新增字典={'鸡':'ji','你':'ni','太':'tai'}
z新增字典['美']='mei'        #新增一个元素到z新增字典
print(z新增字典)            #{'鸡': 'ji', '你': 'ni', '太': 'tai', '美': 'mei'}

'''字典本来有的元素重新赋值叫字典元素的修改？'''
z新增字典['鸡']='j'
z新增字典['你']='n'
z新增字典['太']='t'
z新增字典['美']='m'
print(z新增字典)        #{'鸡': 'j', '你': 'n', '太': 't', '美': 'm'}

print('''@@@@@@@@@@@@@@@@@@@@@@@@@字典的特点：@@@@@@@@@@@@@@@@@@@@@
1、键不可以重复，值可以重复
2、key的位置不能改变，key是不可变对象
3、内存是动态伸缩的
4、会浪费较大的内存空间''')

zj字典={'名字':'ikun','名字':'苏珊'}
print(zj字典)     #{'名字': '苏珊'}，后面的会覆盖前面的