#仰晨不牛马
#牛马时间：2022/7/6 23:02:05

print('---------用两个列表合成一个字典----内置函数zip(*,*)打包两个列表---------')

z列表1=['天美','尼美舒利','垃圾游戏',"用来当键（贱key）",'Fcuk']
z列表2=[167,748,9,"用来当值",888]


z字典1={z列表1:z列表2 for z列表1,z列表2 in zip(z列表1,z列表2)}

print(z字典1)     #{'天美': 167, '尼美舒利': 748, '垃圾游戏': 9, '用来当键（贱key）': '用来当值', 'Fcuk': 888}




#.upper()可以把小写字母全部变成大写######################################################################

z字典2={z列表1.upper():z列表2 for z列表1,z列表2 in zip(z列表1,z列表2)}

print(z字典2)     #{'天美': 167, '尼美舒利': 748, '垃圾游戏': 9, '用来当键（贱KEY）': '用来当值', 'FCUK': 888}


print(zip(z列表1,z列表2))#<zip object at 0x000002179BB17E88>

print('----------如果2个列表元素个数不相等就自动取最短的为基准，比如：')
z列表1=['天美','尼美舒利','垃圾游戏',"用来当键（贱key）",'Fcuk','天美鸡太美']
z列表3=[167,748]
z字典3={z列表1.upper():z列表3 for z列表1,z列表3 in zip(z列表1,z列表3)}
print(z字典3)     #{'天美': 167, '尼美舒利': 748}











