#仰晨不牛马
#牛马时间：2022/7/9 00:57:27

"""
·集合
· Python语言提供的内置数据结构
·与列表、字典一样都属于可变类型的序列·集合是没有value的字典
.是无序的，是可变的
"""
print('------------创建集合的2种方式------------')
print('------第一种直接用｛｝------')

j集合0 = {'鸡', '鸡', '太美', '美', 666, 666}
print(j集合0)     # 无序的，不会有相同的 #{'鸡', 666, '美', '太美'}


print('------第2种用内置函数set（）------')

j集合1 = set(range(6))            # 用range函数生成集合
print(j集合1, type(j集合1))        # {0, 1, 2, 3, 4, 5} <class 'set'>

j集合2 = set([1,22,3,3,4,7,9])    # 用列表生成一个集合
print(j集合2,type(j集合2))         # {1, 3, 4, 7, 9, 22} <class 'set'>

j集合3 = set((1,6,7,'树枝',0))     # 用元组生成一个集合
print(j集合3, type(j集合3))        # {0, 1, 6, 7, '树枝'} <class 'set'>

j集合4=set('与其提升自己。666HH')    # 用字符串生成一个集合
print(j集合4, type(j集合4))        # {'6', '己', '升', '。', '其', 'H', '自', '提', '与'} <class 'set'>

j集合5=set({20,22,7,9,2,20})      # 用集合生成一个集合....
print(j集合5, type(j集合5))        # {2, 20, 22, 7, 9} <class 'set'>

j集合6=set()                      # 生成空集合的唯一办法，直接｛｝会是字典类型
print(j集合6, type(j集合6))        # set() <class 'set'>

j = {}                            # 生成空字典
print(j, type(j))                 # {} <class 'dict'>


print('-----------判定一个元素是否在集合里面-----------------')
j集合7={'疏散', '蜀山', '舒散', '苏珊', '速删'}

print('苏三' in j集合7)      # False
print('苏珊' in j集合7)      # True
print('苏四' not in j集合7)  # True
print('苏珊' not in j集合7)  # False

print('-----在集合中添加元素*.add（加一个元素）--- update（｛最少添加一个元素｝）------')
j集合8={'数字', '庶子', '树脂', '树枝', '素质'}

j集合8.add('俗子')     # 在集合中添加一个元素
print(j集合8)         # {'俗子', '庶子', '树脂', '数字', '素质', '树枝'}

j集合8.update(range(2, 5))     # 在集合中添加多个元素
print(j集合8)         # {'庶子', 2, 3, 4, '数字', '俗子', '树枝', '素质', '树脂'}

j集合8.update({66,"梳子"})     # 在集合中添加多个元素
print(j集合8) # {'俗子', 2, 3, 4, '庶子', '素质', '树枝', 66, '梳子', '数字', '树脂'}


print('''
·集合元素的删除操作
·调用remove()方法，一次删除一个指定元素，如果指定的元素不存在抛出KeyError
·调用discard()方法，一次删除一个指定元素，如果指定的元素不存在不抛异出异常·
·调用pop()方法，一次只删除一个任意元素
·调用clear()方法,清空集合
''')
j集合9={'俗子', 2, 3, 4, '庶子', '素质', '树枝', 66, '梳子', '数字', '树脂'}


j集合9.remove('树脂')   # 删除一个指定元素
print(j集合9)         # {2, 3, 4, '素质', 66, '数字', '俗子', '梳子', '庶子', '树枝'}

# j集合9.remove('数值')   #指定的元素不存在抛出KeyError     #KeyError: '数值'


j集合9.discard(2)       # 删除一个指定元素
print(j集合9)           # { 3, 4, '素质', 66, '数字', '俗子', '梳子', '庶子', '树枝'}
j集合9.discard("树子")   # 指定的元素不存在不抛异出异常
print(j集合9)           # { 3, 4, '素质', 66, '数字', '俗子', '梳子', '庶子', '树枝'}


j集合9.pop()          # 一次只删除一个任意元素...随便删的，还不能指定
print(j集合9)         # {3, 4, 66, '树枝', '数字', '素质', '庶子', '梳子'}
j集合9.pop()
print(j集合9)         # {4, 66, '树枝', '数字', '素质', '庶子', '梳子'}
j集合9.pop()
print(j集合9)         # {66, '树枝', '数字', '素质', '庶子', '梳子'}
j集合9.pop()
print(j集合9)         # {'树枝', '数字', '素质', '庶子', '梳子'}

# j集合9.pop('树枝')    # 不能指定元素，指定就报错 #TypeError: pop() takes no arguments (1 given)

j集合9.clear()        # 清空集合
print(j集合9)         # set()
