# 欲仰清晨却已星辰（懒）
# 始时间：2022/7/19 16:53:06
# 文件名：34、字符串格式化


print('-------------------------三种常见的方法---------------------')

name = '仰晨'
age = 22

print('-----------11111111111 %d=%i=整数,%s=字符串,%f=浮点数,%()')

print('我叫%s，今年%d岁' % (name, age))               # 我叫仰晨，今年22岁

# ===============================================================

print('-----------22222222222  {0}{1}{2}内置函数.format(*,*)')

print('我叫{0},今年{1}岁的{0}'.format(name, age))     # 我叫仰晨,今年22岁的仰晨

# ===============================================================

print('----------33333333333   用f“str”')

print(f'我叫{name},今年{age}岁')                     # 我叫仰晨,今年22岁





print('================宽度和精度================================')
print('0123456789')                 # 0123456789    #用来对比
print('%10d' % 556)                 #        556    #设置宽度，刚好对齐
print('%.2f' % 3.1415926)           # 3.14          #控制小数点（精度）位数
print('%10.2f' % 3.1415926)         #       3.14    #设置精度和宽度

print('{}'.format(3.1415926))       # 3.1415926 #只有一个｛｝可以省略0
print('{:.3}'.format(3.1415926))    # 3.14      #.3表示总共显示3位数
print('{:.3}'.format('唧唧复唧唧'))   # 唧唧复
print('{:.3f}'.format(3.1415926))   # 3.142     #.3f表示显示3位小数
print('{:10.3f}'.format(3.1415926)) #      3.142    #设置精度和宽度

# 结束时间： 2022.7.19 17:33