#仰晨不牛马
#牛马时间：2022/5/27 01:47:43
print('------------x下面是算术、赋值、参数、解包、比较、布尔、位运算----------------------------------------------------')
print('------------x下面是算术运算符----------------------------------------------------')
print(1+1)#加法运算
print(2-5)#减法运算
print(8/4)#除法运算
print(5*4)#乘法运算
print(11//2)####整除运算
print(11%2)#取余
print(2**4)#表示2的4次方 2*2*2*2#幂运算

print(-9//-4)
print(-9//4)#一正一负要向下取整（就是公式哦~）
print(9//-4)
print(11//-2)#-5.5向下取整=-6

print(-9%4)#公式：余数=被除数-除数*商      -9-4*（-3）-->-9+12-->3
print(9%-4)#                           9-(-4)*(-3)-->9-12-->-3


print('------------下面是赋值运算符--------------------------------------------------------------')
#赋值运算符是从又到左的
a=b=c=2 #链式赋值地址会相同
print(a,id(a))
print(b,id(b))
print(c,id(c))


print('------------参数赋值-------------')
x=20
x+=30#x=x+30--->50
print(x)#50
x-=20#x=x-20-->30
print(x)#30
x*=20
print(x)
x/=20
print(x)
x//=20
print(x)
x%=20
print(x)

print('------------解包赋值-------------')
a,b,c=20,30.0,'牛马'  #左右个数要相等

print(a,b,c)


print('------------两值互换-------------')

y=13
z=14
print('交换之前y=%d，z=%d'%(y,z))

y,z=z,y  #直接交换不用中间值

print('交换之后y=%d，z=%d'%(y,z))



print('------------下面是比较运算符--------------------------------------------------------------')
#比较运算符的结果是bool类型哦
仰晨,芷晴=23,22
print('仰晨=%d，芷晴=%d' % (仰晨, 芷晴))
print('仰晨大过芷晴吗', 仰晨 > 芷晴)   # True

print('仰晨小过芷晴吗', 仰晨< 芷晴)


print('仰晨>=芷晴吗', 仰晨 >= 芷晴)
print('仰晨<=芷晴吗', 仰晨 <= 芷晴)
print('仰晨==芷晴吗', 仰晨 == 芷晴)
print('仰晨!=芷晴吗', 仰晨 != 芷晴)


'''一个变量由三部分组成：标识(id)、类型、值(value)
    ==比较的是值   
    比较变量的标识 用 is    或  is not'''
a = 10
b = 10
print(a == b)     # true 说明value值相等
print(a is b)   # true 说明id相等
print(a is not b)
# #数组
print('比较牛马12')
n牛马1 = [55, 66, 77]
n牛马2 = [55, 66, 77]
print(n牛马1 == n牛马2)   # true 说明value值相等
print(n牛马1 is n牛马2)   # False 说明id不相等
print(n牛马1 is not n牛马2)
print(id(n牛马1))
print(id(n牛马2))


print('------------下面是布尔运算符--------------------------------------------------------------')
aa = 1
bb = 2
print('aa=', aa, 'bb=', bb)
print('-----------与运算--#and两个都对才是对')
print(aa == 1 and bb==2)#and两个都对才是对 --> true
print(aa != 1 and bb>2)#and两个都对才是对 --> false

print('-----------或运算--or有一个对就是对')
print(aa == 1 or bb != 2)     # 一个对就是对
print(aa != 1 or bb > 2)      # 没有对才是错


print('---------非运算（取反）对就是错，错就是对')
w我会错=False
print(not w我会错)
print(not bb==2)

print('--------in 和 not in--')
s串='abcde'
print('a' in s串)        #ture
print('f' in s串)        #false
print('a' not in s串)    #false
print('f' not in s串)    #ture



print('------------下面是位运算--------------------------------------------------------------')
'''位&与  都是1才是1 否则0
  位|或   都是0才0   否则1
  左移<<  高位溢出舍弃 低位补0
  右移>>  低位溢出舍弃 高位补0
  4的二进制是 00000100  （八位）
  '''
print(4&8)
print(4|8)
print(4<<1)  #每移动1位相当于*2  =8          高位溢出舍弃 低位补0
print(4<<2)  #1位*2，1位*2  总*4   =16

print(4>>1) #每移动1位相当于/2  =2
print(4>>2)#/2再/2=1                        低位溢出舍弃 高位补0


print('''运算符的优先级 ↓（先算括号）
算术 （**）（* / // %）（- +）
位   （<< >>）（&）(|)
比较（< > <= >= == !=）
布尔(and)(or)
赋值 =
''')


#牛马时间：2022/5/28 02:30:40