# 仰晨
# 始时间：2022/7/24 02:03:19
# 文件名：个性字母and数字


sss = input("请输入一坨带字母或数字的字符串（1-6行数字是变态的）\n")
abc = 'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ'
one = '0123456789'
# --------------------------要变化的--------------------------


# 样式1---------------------------------------------------------------------111111111111111111111
aa = "𝐚𝐛𝐜𝐝𝐞𝐟𝐠𝐡𝐢𝐣𝐤𝐥𝐦𝐧𝐨𝐩𝐪𝐫𝐬𝐭𝐮𝐯𝐰𝐱𝐲𝐳𝐀𝐁𝐂𝐃𝐄𝐅𝐆𝐇𝐈𝐉𝐊𝐋𝐌𝐍𝐎𝐏𝐐𝐑𝐒𝐓𝐔𝐕𝐖𝐗𝐘𝐙"
a1 = "𝟎𝟏𝟐𝟑𝟒𝟓𝟔𝟕𝟖𝟗"
列表 = []
for i in sss:
    if i in abc:
        索引 = abc.index(i)
#        if 索引 > 25:                       # 从零开始
#            索引 = 索引-26
        i = aa[索引]
    elif i in one:
        索引 = one.index(i)
        i = a1[索引]
    列表.append(i)
for ii in 列表:
    print(ii, end="")
print()

# 样式2-------------------------------------------------222222222222222222222222222222222
aa = "𝒂𝒃𝒄𝒅𝒆𝒇𝒈𝒉𝒊𝒋𝒌𝒍𝒎𝒏𝒐𝒑𝒒𝒓𝒔𝒕𝒖𝒗𝒘𝒙𝒚𝒛𝑨𝑩𝑪𝑫𝑬𝑭𝑮𝑯𝑰𝑱𝑲𝑳𝑴𝑵𝑶𝑷𝑸𝑹𝑺𝑻𝑼𝑽𝑾𝑿𝒀𝒁"
a1 = "𝟢𝟣𝟤𝟥𝟦𝟧𝟨𝟩𝟪𝟫"
列表 = []
for i in sss:
    if i in abc:
        索引 = abc.index(i)
#        if 索引 > 25:                       # 从零开始
#            索引 = 索引-26
        i = aa[索引]
    elif i in one:
        索引 = one.index(i)
        i = a1[索引]
    列表.append(i)
for ii in 列表:
    print(ii, end="")
print()


# 样式3-----------------分大小写----------------------------------3333333333333333333333333
aa = "𝕒𝕓𝕔𝕕𝕖𝕗𝕘𝕙𝕚𝕛𝕜𝕝𝕞𝕟𝕠𝕡𝕢𝕣𝕤𝕥𝕦𝕧𝕨𝕩𝕪𝕫𝔸𝔹ℂ𝔻𝔼𝔽𝔾ℍ𝕀𝕁𝕂𝕃𝕄ℕ𝕆ℙℚℝ𝕊𝕋𝕌𝕍𝕎𝕏𝕐ℤ"
a1 = "𝟘𝟙𝟚𝟛𝟜𝟝𝟞𝟟𝟠𝟡"
列表 = []
for i in sss:
    if i in abc:
        索引 = abc.index(i)
        i = aa[索引]
    elif i in one:
        索引 = one.index(i)
        i = a1[索引]
    列表.append(i)
for ii in 列表:
    print(ii, end="")
print()

# 样式4-----------------分大小写----------------------------------444444444444444444444444444
aa = "𝑎𝑏𝑐𝑑𝑒𝑓𝑔𝒽𝑖𝑗𝑘𝑙𝑚𝑛𝑜𝑝𝑞𝑟𝑠𝑡𝑢𝑣𝑤𝑥𝑦𝑧𝐴𝐵𝐶𝐷𝐸𝐹𝐺𝐻𝐼𝐽𝐾𝐿𝑀𝑁𝑂𝑃𝑄𝑅𝑆𝑇𝑈𝑉𝑊𝑋𝑌𝑍"# 𝒽是借来的，本来的无法显示
a1 = "𝟶𝟷𝟸𝟹𝟺𝟻𝟼𝟽𝟾𝟿"
列表 = []
for i in sss:
    if i in abc:
        索引 = abc.index(i)
        i = aa[索引]
    elif i in one:
        索引 = one.index(i)
        i = a1[索引]
    列表.append(i)
for ii in 列表:
    print(ii, end="")
print()


# 样式5-----------------分大小写----------------------------------55555555555555555555555555555
aa = "𝗮𝗯𝗰𝗱𝗲𝗳𝗴𝗵𝗶𝗷𝗸𝗹𝗺𝗻𝗼𝗽𝗾𝗿𝘀𝘁𝘂𝘃𝘄𝘅𝘆𝘇𝗔𝗕𝗖𝗗𝗘𝗙𝗚𝗛𝗜𝗝𝗞𝗟𝗠𝗡𝗢𝗣𝗤𝗥𝗦𝗧𝗨𝗩𝗪𝗫𝗬𝗭"
a1 = "𝟬𝟭𝟮𝟯𝟰𝟱𝟲𝟳𝟴𝟵"
列表 = []
for i in sss:
    if i in abc:
        索引 = abc.index(i)
        i = aa[索引]
    elif i in one:
        索引 = one.index(i)
        i = a1[索引]
    列表.append(i)
for ii in 列表:
    print(ii, end="")
print()

# 样式7-666----------------数字没正常样式了----------------------------------7777777766666666
aa = "𝙖𝙗𝙘𝙙𝙚𝙛𝙜𝙝𝙞𝙟𝙠𝙡𝙢𝙣𝙤𝙥𝙦𝙧𝙨𝙩𝙪𝙫𝙬𝙭𝙮𝙯𝘼𝘽𝘾𝘿𝙀𝙁𝙂𝙃𝙄𝙅𝙆𝙇𝙈𝙉𝙊𝙋𝙌𝙍𝙎𝙏𝙐𝙑𝙒𝙓𝙔𝙕"

列表 = []
for i in sss:
    if i in abc:
        索引 = abc.index(i)
        i = aa[索引]
    列表.append(i)
for ii in 列表:
    print(ii, end="")
print()

# 样式6-7777----------------数字没正常样式了----------------------------------66777777
aa = "𝚊𝚋𝚌𝚍𝚎𝚏𝚐𝚑𝚒𝚓𝚔𝚕𝚖𝚗𝚘𝚙𝚚𝚛𝚜𝚝𝚞𝚟𝚠𝚡𝚢𝚣𝙰𝙱𝙲𝙳𝙴𝙵𝙶𝙷𝙸𝙹𝙺𝙻𝙼𝙽𝙾𝙿𝚀𝚁𝚂𝚃𝚄𝚅𝚆𝚇𝚈𝚉"

列表 = []
for i in sss:
    if i in abc:
        索引 = abc.index(i)
        i = aa[索引]
    列表.append(i)
for ii in 列表:
    print(ii, end="")
print()


# 样式8-----------------数字没正常样式了----------------------------------88888888888888888888888
aa = "𝘢𝘣𝘤𝘥𝘦𝘧𝘨𝘩𝘪𝘫𝘬𝘭𝘮𝘯𝘰𝘱𝘲𝘳𝘴𝘵𝘶𝘷𝘸𝘹𝘺𝘻𝘈𝘉𝘊𝘋𝘌𝘍𝘎𝘏𝘐𝘑𝘒𝘓𝘔𝘕𝘖𝘗𝘘𝘙𝘚𝘛𝘜𝘝𝘞𝘟𝘠𝘡"

列表 = []
for i in sss:
    if i in abc:
        索引 = abc.index(i)
        i = aa[索引]
    列表.append(i)
for ii in 列表:
    print(ii, end="")
print()

# 样式9-----------------数字没正常样式了----------------------------------99999999999999999999999
aa = "𝖺𝖻𝖼𝖽𝖾𝖿𝗀𝗁𝗂𝗃𝗄𝗅𝗆𝗇𝗈𝗉𝗊𝗋𝗌𝗍𝗎𝗏𝗐𝗑𝗒𝗓𝖠𝖡𝖢𝖣𝖤𝖥𝖦𝖧𝖨𝖩𝖪𝖫𝖬𝖭𝖮𝖯𝖰𝖱𝖲𝖳𝖴𝖵𝖶𝖷𝖸𝖹"

列表 = []
for i in sss:
    if i in abc:
        索引 = abc.index(i)
        i = aa[索引]
    列表.append(i)
for ii in 列表:
    print(ii, end="")
print()


# 样式10-----------------数字没正常样式了（英语好像也不正常了）----------------------------------1010101010101010
aa = "𝖆𝖇𝖈𝖉𝖊𝖋𝖌𝖍𝖎𝖏𝖐𝖑𝖒𝖓𝖔𝖕𝖖𝖗𝖘𝖙𝖚𝖛𝖜𝖝𝖞𝖟𝕬𝕭𝕮𝕯𝕰𝕱𝕲𝕳𝕴𝕵𝕶𝕷𝕸𝕹𝕺𝕻𝕼𝕽𝕾𝕿𝖀𝖁𝖂𝖃𝖄𝖅"

列表 = []
for i in sss:
    if i in abc:
        索引 = abc.index(i)
        i = aa[索引]
    列表.append(i)
for ii in 列表:
    print(ii, end="")
print()


# 样式11-----------------数字没正常样式了----------------------------------11111111111111
aa = "𝒶𝒷𝒸𝒹𝑒𝒻𝑔𝒽𝒾𝒿𝓀𝓁𝓂𝓃𝑜𝓅𝓆𝓇𝓈𝓉𝓊𝓋𝓌𝓍𝓎𝓏𝒜ℬ𝒞𝒟ℰℱ𝒢ℋℐ𝒥𝒦ℒℳ𝒩𝒪𝒫𝒬ℛ𝒮𝒯𝒰𝒱𝒲𝒳𝒴𝒵"     # 𝑒𝑔𝑜借了样式43个🔠字母

列表 = []
for i in sss:
    if i in abc:
        索引 = abc.index(i)
        i = aa[索引]
    列表.append(i)
for ii in 列表:
    print(ii, end="")
print()


# 样式12-----------------数字没正常样式了----------------------------------1212121212121212
aa = "𝓪𝓫𝓬𝓭𝓮𝓯𝓰𝓱𝓲𝓳𝓴𝓵𝓶𝓷𝓸𝓹𝓺𝓻𝓼𝓽𝓾𝓿𝔀𝔁𝔂𝔃𝓐𝓑𝓒𝓓𝓔𝓕𝓖𝓗𝓘𝓙𝓚𝓛𝓜𝓝𝓞𝓟𝓠𝓡𝓢𝓣𝓤𝓥𝓦𝓧𝓨𝓩"

列表 = []
for i in sss:
    if i in abc:
        索引 = abc.index(i)
        i = aa[索引]
    列表.append(i)
for ii in 列表:
    print(ii, end="")
print()

